icofoam-cases/thermal-channel-2d/constant/decomposeParDict
mFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;

method          simple;

simpleCoeffs
{
    n               (1 3 2);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 2 2);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}

scotchCoeffs
{
}

// ************************************************************************* //

